app/Http/Controllers/PostController.php

select `posts`.*, (select sum(`votes`.`vote`) from `votes` where `posts`.`id` = `votes`.`post_id`) as `votes_score` from `posts` where `status` = 'published' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `posts` where `status` = 'published'
select * from `votes` where `votes`.`post_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10) and `user_id` = 1
---
    public function index(): View
    {
        $page = request('page', 1);
        $cacheKey = 'all_posts_page_' . $page;

        $posts = Cache::tags(['posts'])->remember($cacheKey, 300, fn() =>
        Post::with('ownerOfPost')
            ->withSum('votes as votes_score', 'vote')
            ->where('status', PostStatus::Published)
            ->latest()
            ->paginate(10)
        );
        if (auth()->check()) {
            $userId = auth()->id();
            $posts->getCollection()->load(['userVote' => function ($q) use ($userId) {
                $q->where('user_id', $userId);
            }]);

select * from `comments` where `comments`.`post_id` in (1)
select * from `users` where `users`.`id` in (1)
---
    public function show(Post $post): View
    {
        $post = Cache::tags(["post:{$post->id}"])->remember("post:{$post->id}", now()->addMinutes(10),
            fn() => $post->load('ownerOfPost',
                'comments.user',
                'comments.replies.user')->loadCount('comments'));