app/Http/Controllers/ProfileController.php

    public function avatar(NewAvatarRequest $request): RedirectResponse
    {
        $avatar = Auth::user()->avatar;
        if ($avatar !== null) {
            Storage::disk(name: 'public')->delete("images/avatars/$avatar");
        }
        $name = $this->avatarUpload(file: $request->file('profile_image'), path: 'images/avatars');

        Auth::user()->update(['avatar' => $name]);
---
update `users` set `avatar` = '693aaeac25f00.webp', `users`.`updated_at` = '2025-12-11 11:44:44' where `id` = 1

    public function info(User $user): View
    {
        $profile = Cache::tags(["user:{$user->id}"])->remember(
            "user.info.{$user->id}",
            now()->addMinutes(10),
            fn () => $user->load([
                'sendFriend',
                'receiveFriend',
                'followers',
                'following',
            ])->loadCount(['posts', 'followers'])
        );
---
select `users`.*, `subscriptions`.`user_id` as `pivot_user_id`, `subscriptions`.`subscriber_id` as `pivot_subscriber_id`, `subscriptions`.`created_at` as `pivot_created_at`, `subscriptions`.`updated_at` as `pivot_updated_at` from `users` inner join `subscriptions` on `users`.`id` = `subscriptions`.`subscriber_id` where `subscriptions`.`user_id` in (2)