app/Http/Controllers/ReplyCommentController.php

insert into `reply_comments` (`comment_id`, `reply_comment`, `user_id`, `updated_at`, `created_at`) values ('1', 'its not really true', 1, '2025-12-11 09:18:12', '2025-12-11 09:18:12')
---
    public function store(ReplyRequest $request): RedirectResponse
    {
        $data = array_merge($request->validated(), ['user_id' => auth()->id()]);
        ReplyComment::create($data);